{
 "cells": [
  {
   "cell_type": "markdown",
   "id": "764e0191",
   "metadata": {},
   "source": [
    "### Testing neo4j cleint and cypher queries"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 1,
   "id": "ba1dec4d",
   "metadata": {},
   "outputs": [],
   "source": [
    "from neo4j import GraphDatabase"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "id": "8d255047",
   "metadata": {},
   "outputs": [],
   "source": [
    "driver = GraphDatabase.driver(\"bolt://localhost:7687\", auth=(\"neo4j\", \"neo4j\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": null,
   "id": "87661090",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Record mark=<Node element_id='4:0bea032b-bcd8-40e9-abd6-f6979d626659:0' labels=frozenset({'Mark'}) properties={'name': 'Southampton'}>>"
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "def add_mark(name: str): \n",
    "    query = \"\"\"\n",
    "    CREATE (mark:Mark {name: $name})\n",
    "    RETURN mark\n",
    "    \"\"\"\n",
    "\n",
    "    with driver.session() as session:\n",
    "        result = session.run(query, name = name)\n",
    "        return result.single()\n",
    "\n",
    "def get_marks():\n",
    "    query = \"MATCH (mark: Mark) RETURN mark.name As name\"\n",
    "    with driver.session() as session:\n",
    "        return [record[\"name\"] for record in session.run(query)]\n"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 6,
   "id": "53b6b486",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Record mark=<Node element_id='4:0bea032b-bcd8-40e9-abd6-f6979d626659:3' labels=frozenset({'Mark'}) properties={'name': 'Cowes'}>>"
      ]
     },
     "execution_count": 6,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "add_mark(\"Sothampton\")\n",
    "add_mark(\"Cowes\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 7,
   "id": "ec03644e",
   "metadata": {},
   "outputs": [
    {
     "data": {
      "text/plain": [
       "['Southampton', 'Cowes', 'Sothampton', 'Cowes']"
      ]
     },
     "execution_count": 7,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "get_marks()"
   ]
  },
  {
   "cell_type": "markdown",
   "id": "1d3f43b3",
   "metadata": {},
   "source": []
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "kelder_api",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.12.11"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 5
}
